app/Http/Controllers/HomeController.php

select * from `posts`
---
  public function index()
  {
    $posts = Post::all();