app/Http/Controllers/PostController.php

  public function show($slug)
  {
    //qui per la show per recuperare il dato cliccato
    //non posso utilizzare find perchè find funziona con l'id
    $post = Post::where('slug', $slug)->first();
---
select * from `posts` where `slug` = 'id-quo-et-quas-expedita-maxime-sapiente' limit 1

  public function posts_of_x_category($slug)
  {
    //creo due variabili una category e l'altra posts
    // la variabile $category è = oggetto Category dove
    //nella colonna 'slug' ha valore = $slug
    $category =Category::where('slug', $slug)->first();
---
select * from `categories` where `slug` = 'Tempo libero' limit 1

  public function posts_of_x_tags($slug)
  {
    //creo due variabili una tags e l'altra posts
    // la variabile $tags è = oggetto Tag dove
    //nella colonna 'slug' ha valore = $slug
    $tags = Tag::where('slug', $slug)->first();
---
select * from `tags` where `slug` = 'divertente' limit 1