app/Http/Controllers/Admin/PostController.php

select * from `posts`
---
    public function index()
    {
      //questa è pagina index dei post nell'area riservata
      $posts = Post::all();

select * from `categories`
select * from `tags`
---
    public function create()
    {
      //qui non posso fare solo return view('admin.posts.create'); ma
      //nel file create.blade devo ciclare sulla colonna category_id
      //che è presente nella tabella categories quindi
      // creo nuovo model Category e mi ricordo di inserire
      //use App\Category;
      //lo stesso per Tag
      $categories = Category::all();
      $tags = Tag::all();

insert into `posts` (`title`, `content`, `author`, `slug`, `updated_at`, `created_at`) values ('nuovo post carolai', 'fsdfjslkfjslkfjlkd', 'Carola', 'nuovo-post-carolai', '2019-07-21 20:43:01', '2019-07-21 20:43:01')
insert into `post_tag` (`post_id`, `tag_id`) values (16, 2)
---
      //etc.. con tutti
      //compila l'ggeto con questi dati
      $nuovo_post->fill($dati);
      $nuovo_post->save();
      //
      $nuovo_post->tags()->sync($dati['tag']);

select * from `posts` where `slug` = 'id-quo-et-quas-expedita-maxime-sapiente' limit 1
---
    public function show($slug) //non metto id ma slug
    {
      //utlizzo where e non find perche find va con id
      $post =Post::where('slug', $slug)->first();

select * from `posts` where `slug` = 'nuovo-post-carola' limit 1
select * from `categories`
select * from `tags`
---
    public function edit($slug)
    {
      //uguale a Show
      //recupero id qui lo slug
      $post =Post::where('slug', $slug)->first();
      if (empty($post)) {
        abort(404);
      }
      $categories = Category::all();
      $tags = Tag::all();