app/Http/Controllers/Admin/PostController.php

select * from `posts` where `slug` = 'id-quo-et-quas-expedita-maxime-sapiente' limit 1
---
    public function show($slug) //non metto id ma slug
    {
      //utlizzo where e non find perche find va con id
      $post =Post::where('slug', $slug)->first();